InformationRegisters/ЛБ_СостояниеЗалоговогоБилета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СостояниеЗалоговогоБилета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусЗалоговогоБилета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыЗалоговыхБилетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаРасчетаПроцентов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДопСоглашения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупаЛьготныйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗайма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗаймаДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОстановкиНачислений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплатыБезПродления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗалоговогоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_РасчетыСКлиентамиПоОбъектамЗалога</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ОбъектыЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ОбъектыЗалога</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ДокументыЗалогодателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ДокументыЗалогодателей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДУЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДоп</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Comment>Дата выдачи документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Comment>Кем выдан </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Comment>Серия документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Comment>Номер документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНеДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСтранаЭмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНаименованиеИногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДокументыЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокументаЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДокументовЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ОтменыОперацийЗБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОтменыОперацийЗБ</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЗалоговогоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОтмененныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_СтатусыЗалоговыхБилетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыЗалоговыхБилетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оформлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтвественноеХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изъят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтОформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наследство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключенВНакладную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъявленТорг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтправкеОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПутиОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыПроцентныхСтавок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыПроцентныхСтавок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Базовая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Акционная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Техническая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ИзъятиеОбъектовЗалога/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если НЕ ТекПользователь.ЭтоЛомбард Тогда
   		Если УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО") Тогда
			СотрудникЦО = Истина;
		КонецЕсли;
	КонецЕсли;	

	Если Параметры.Свойство("Документ") Тогда
        ДокументИзъятия = Параметры.Документ; 
		Если ДокументИзъятия.Проведен тогда
			НеРедактировать = Истина;
			Элементы.ДекорацияСтатусДокумента.Заголовок = "Факт"; 
			Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноБордовый;  
			Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.ТусклоРозовый;
		Иначе
			Элементы.ДекорацияСтатусДокумента.Заголовок = "Проект"; 
			Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноЗеленый;
			Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.СветлоЗеленый;
		КонецЕсли;		
		ДатаДок = ДокументИзъятия.Дата; 
		Ломбард = ДокументИзъятия.Ломбард;
		ОтветственныйПользователь = ДокументИзъятия.ОтветственныйПользователь;
		ОтветственныйСотрудник = ДокументИзъятия.ОтветственныйСотрудник;
		Комментарий = ДокументИзъятия.Комментарий;
		ЗалоговыйБилет = ДокументИзъятия.ПредыдущаяОперация;  
		ДатаИзъятия = ДокументИзъятия.ДатаИзъятия;  
		ГосОрганИзъятие = ДокументИзъятия.ГосОрганИзъятие;
		ДатаПротоколИзъятия = ДокументИзъятия.ДатаПротоколИзъятия;
		ДокументИзъятияНаименование = ДокументИзъятия.ДокументИзъятияНаименование;
		ДокументИзъятияДатаВыдачи = ДокументИзъятия.ДокументИзъятияДатаВыдачи;
		ДокументИзъятияКемВыдан = ДокументИзъятия.ДокументИзъятияКемВыдан;
		ФИОДолжностьИзъятие = ДокументИзъятия.ФИОДолжностьИзъятие;
		ФИОДолжностьСудьи = ДокументИзъятия.ФИОДолжностьСудьи;
		ПричинаПримененияПроцентнойСхемы = ЛБ_УправлениеЛомбардом.ПолучитьПричинуПримененияПроцентнойСхемы(ДокументИзъятия, ЗалоговыйБилет);
		ЗаполнитьТовары();  
		ЗаполнитьСостояниеЗалоговогоБилета();
		//+Мельников 25.04.24 Отмена операции.
		ДокументОтмены = ПолучитьДокументОтмены(ДокументИзъятия); //Было: ДокументИзъятия.ДокументОтмены;
		//-Мельников     
		Если Параметры.ТолькоПросмотр = Истина Тогда	
			Этаформа.ТолькоПросмотр = Истина;
		КонецЕсли;
	ИначеЕсли Параметры.Свойство("ЗалоговыйБилет") Тогда
		ЗалоговыйБилет = Параметры.ЗалоговыйБилет; 
		СтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(ТекущаяДата(), ЗалоговыйБилет);
		Если НЕ СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Закрыт Тогда
			Если Параметры.Свойство("Ломбард") Тогда 
				Ломбард = Параметры.Ломбард;
			Иначе	
			    Ломбард = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();  
			КонецЕсли;	
			ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
			//Если НЕ ТекПользователь.ЭтоЛомбард Тогда
			//  	ОтветственныйПользователь = ТекПользователь;
			//Иначе
			//	ОтветственныйПользователь = ПараметрыСеанса.ТекущийСотрудник;
			//КонецЕсли;
			ОтветственныйПользователь = ПараметрыСеанса.ТекущийПользователь;
			ОтветственныйСотрудник = ПараметрыСеанса.ТекущийСотрудник;

			ДатаДок = ТекущаяДатаСеанса(); 
			ДатаИзъятия = ДатаДок;
			ДатаПротоколИзъятия = ДатаДок;
			ПричинаПримененияПроцентнойСхемы = ЛБ_УправлениеЛомбардом.ПолучитьПричинуПримененияПроцентнойСхемы(, ЗалоговыйБилет);
			ЗаполнитьТовары();    
			//МожноИзъять = Ложь;
			//Для каждого Стр Из ТаблицаТоваров Цикл 
			//	Если стр.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Возвращен ИЛИ  
			//		 стр.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Принят ИЛИ
			//		 стр.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Продлен ИЛИ  
			//		 стр.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ВключенВНакладную ИЛИ
			//		 стр.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ОбъявленТорг ИЛИ
			//		 стр.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ОтвественноеХранение Тогда  
			//		МожноИзъять = Истина;
			//		Прервать;
			//	КонецЕсли;	 
			//Конеццикла;	     
			//Если НЕ МожноИзъять Тогда
			//	Сообщить("У выбранного залогового билета нет объектов залога, которые можно изъять. Изъятие невозможно!");
			//Иначе	
			    ЗаполнитьСостояниеЗалоговогоБилета();  
			//КонецЕсли;	
		Иначе 
			Сообщить("Статус выбранного залогового билета " + ?(СтатусЗБ = неопределено, "не определен", строка(СтатусЗБ)) + ". Изъятие невозможно!"); 
		    Отказ = Истина;
	    КонецЕсли;
	Иначе 
		Сообщить("Не выбран залоговый билет!"); 
		Отказ = Истина;
	КонецЕсли;
	//+Мельников 25.04.24 Отмена операции.
	УстановитьВидимость(); 	
	//-Мельников
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НеРедактировать Тогда  
		Элементы.Редактировать.Видимость = ?(Этаформа.ТолькоПросмотр, Ложь, Истина);  
		Элементы.Изъять.Доступность = ложь;
		Элементы.Отмена.Заголовок = "Закрыть";
	КонецЕсли;
	Элементы.ОсновнаяПанель.ТолькоПросмотр = НеРедактировать;
	ПриСменеСтраницы(Элементы.ОсновнаяПанель.ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	ЭтаФорма.ТолькоПросмотр = НеРедактировать;  
	Элементы.ДекорацияСтатусДокумента.Заголовок = "Проект"; 
	Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноЗеленый;
	Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.СветлоЗеленый;
	Элементы.Редактировать.Видимость = Ложь;  
	Элементы.Изъять.Доступность = Истина;
	Элементы.Отмена.Заголовок = "Отмена";
КонецПроцедуры   

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ЭтаФорма.Закрыть(?(ЗначениеЗаполнено(ДокументИзъятия), ДокументИзъятия, неопределено));
КонецПроцедуры

&НаСервере
Функция СоздатьНовоеИзъятие()
	ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
	ДокументОбъект.ПредыдущаяОперация = ЗалоговыйБилет; 
	ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога;
	ДокументОбъект.Дата = ДатаДок;
	ДокументОбъект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
	ДокументОбъект.ПроцентнаяСхема = ЗалоговыйБилет.ПроцентнаяСхема;
	Возврат ДокументОбъект; 
КонецФункции

&НаСервере
Процедура РаспределитьСуммуОплатыСсудыТовары(СуммаОплатыСсуда) 
	СуммаДляРаспределения = СуммаОплатыСсуда;
	СуммаДляРаспределения = окр(СуммаДляРаспределения, 2);
	НомСтрМакс = 0; 
	МаксЗадолженность = 0;
	ЗадолженностьИтог = ТаблицаТоваров.Итог("Задолженность");
	Для каждого Стр Из ТаблицаТоваров Цикл 
		Коэфф = Стр.Задолженность/ЗадолженностьИтог;
		Стр.СуммаОплатыПереплата = СуммаОплатыСсуда*Коэфф; 
		Стр.СуммаОплаты = Стр.СуммаОплаты + Стр.СуммаОплатыПереплата;
		Стр.Задолженность = Стр.Задолженность - Стр.СуммаОплатыПереплата;
		СуммаДляРаспределения = СуммаДляРаспределения - Стр.СуммаОплатыПереплата;
		Если Стр.Задолженность > МаксЗадолженность Тогда
			МаксЗадолженность = Стр.Задолженность;  
			НомСтрМакс = стр.НомерСтроки-1;
		КонецЕсли;	
	КонецЦикла;
	Если НЕ СуммаДляРаспределения = 0 Тогда
		Стр = ТаблицаТоваров.Получить(НомСтрМакс);
		Стр.СуммаОплатыПереплата = Стр.СуммаОплатыПереплата + СуммаДляРаспределения;
		Стр.СуммаОплаты = Стр.СуммаОплаты + СуммаДляРаспределения;
		Стр.Задолженность = Стр.Задолженность - СуммаДляРаспределения;
	КонецЕсли;  
	ТоварыИтогОплата = ТаблицаТоваров.Итог("СуммаОплаты");
	ТоварыИтогДолг = ТаблицаТоваров.Итог("Задолженность");
КонецПроцедуры	

&НаСервере
Функция РасчитатьДолгПоПроцентам(СуммаЗайма, ПроцентнаяСтавка, ДатаНачалаРасчета, ДатаОкончанияРасчета)
	Если ЗначениеЗаполнено(ДокументИзъятия) И ДокументИзъятия.Проведен Тогда   
		ДокументОбъект = ДокументИзъятия.ПолучитьОбъект();
	Иначе	      
		ДокументОбъект = СоздатьНовоеИзъятие(); 	    
	КонецЕсли;	    
    СтруктураП = ЛБ_УправлениеЛомбардом.ПолучитьПредельныеЗначенияПроцентов(ДатаДок, ДокументОбъект.Организация);
	Если НЕ СтруктураП = неопределено Тогда
	    ПланкаПроцентов = СтруктураП.ПланкаПроцентов;
		ПредельноеЗначениеПроцентов = СуммаЗайма*СтруктураП.ПланкаПроцентов; 
	Иначе
		ПредельноеЗначениеПроцентов = 0;
	КонецЕсли;   
	СтруктураОкр = ЛБ_УправлениеЛомбардом.ПолучитьУсловияОкругленияПроцентов(ЗалоговыйБилет);
	Установки = ЛБ_УправлениеЛомбардом.ПолучитьУсловияПоДоговору(ЗалоговыйБилет);
	Результат = ЛБ_ОбщийМодуль.РассчитатьСуммуПроцентовИзъятие(ДокументОбъект, ДатаНачалаРасчета, ДатаОкончанияРасчета, ПредельноеЗначениеПроцентов, ПричинаПримененияПроцентнойСхемы, Установки, СтруктураОкр);
	Если Результат.ПредельноеЗначениеПоДоговору Тогда
	    Сообщить("Достигнуто предельное значение суммы процентов по договору.", Статуссообщения.Информация);
	КонецЕсли; 
	
	Если НЕ Результат.СуммаПроцентов = 0 Тогда
		ТаблицаОплатДетально.Очистить();
		Для каждого стр из ДокументОбъект.НачислениеПроцентовДетально Цикл 
		    НоваяСтр = ТаблицаОплатДетально.Добавить(); 
			ЗаполнитьЗначенияСвойств(НоваяСтр, стр);
		КонецЦиклА;	 
	КонецЕсли;	
	Если НЕ Результат.СуммаЗайма = 0 Тогда 
		РаспределитьСуммуОплатыСсудыТовары(Результат.СуммаЗайма);
	КонецЕсли;     
	СтруктураВозврата = Новый Структура;     
	СтруктураВозврата.Вставить("СуммаПроцентов", Результат.СуммаПроцентов);
	СтруктураВозврата.Вставить("СуммаОплатыЗайма", Результат.СуммаЗайма);
	Возврат СтруктураВозврата;
КонецФункции	

&НаСервере
Процедура ЗаполнитьСостояниеЗалоговогоБилета() 
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Если ЗначениеЗаполнено(ДокументИзъятия) Тогда
		Запрос.УстановитьПараметр("Период", ДатаДок-1); 
	Иначе	
	    Запрос.УстановитьПараметр("Период", ДатаДок); 
	КонецЕсли;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилета.Регистратор КАК Регистратор,
	               |	ЛБ_СостояниеЗалоговогоБилета.СуммаЗайма КАК СуммаЗайма,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаВыкупа КАК ДатаВыкупа,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок,
	               |	ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчетаПроцентов,
	               |	ЛБ_СостояниеЗалоговогоБилета.СуммаПроцентовДень КАК СуммаПроцентовДень,
	               |	ЛБ_СостояниеЗалоговогоБилета.СуммаПроцентовСрок КАК СуммаПроцентовСрок
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет = &ЗалоговыйБилет
	               |	И ЛБ_СостояниеЗалоговогоБилета.Период <= &Период
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_СостояниеЗалоговогоБилета.Период";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();  
	ТаблицаСостояний.Очистить();
	Если ТаблицаЗапроса.Количество() > 0 Тогда
		СтрСостояние = ТаблицаЗапроса.Получить(0);
		НоваяСтр = ТаблицаСостояний.Добавить();
		НоваяСтр.Состояние = "Начальные условия займа";
		НоваяСтр.КлючСтроки = 1;
		НоваяСтр.Статус = СтрСостояние.СтатусЗалоговогоБилета;
		НоваяСтр.СуммаЗайма = СтрСостояние.СуммаЗайма;
		НоваяСтр.ДатаВозврата = СтрСостояние.ДатаВыкупа;
		НоваяСтр.ДатаВозвратаЛьготная = СтрСостояние.ДатаВыкупаЛьготныйСрок; 
		НоваяСтр.ДатаНачалаРасчета = СтрСостояние.ДатаНачалаРасчетаПроцентов;
		НоваяСтр.ПроцентнаяСтавка = ЗалоговыйБилет.ПроцентнаяСхема;
		НоваяСтр.СуммаПроцентовДень = СтрСостояние.СуммаПроцентовДень;
		НоваяСтр.СуммаПроцентовСрок = СтрСостояние.СуммаПроцентовСрок;
		
		КолСтр = ТаблицаЗапроса.Количество()-1;
		СтрСостояние = ТаблицаЗапроса.Получить(КолСтр);
		НоваяСтр = ТаблицаСостояний.Добавить();
		НоваяСтр.Состояние = "Состояние залогового билета до изъятия";
		НоваяСтр.КлючСтроки = 2;
		НоваяСтр.Статус = СтрСостояние.СтатусЗалоговогоБилета; 
		НоваяСтр.СуммаЗайма = СтрСостояние.СуммаЗайма;
		НоваяСтр.ДатаВозврата = СтрСостояние.ДатаВыкупа;
		НоваяСтр.ДатаВозвратаЛьготная = СтрСостояние.ДатаВыкупаЛьготныйСрок; 
		НоваяСтр.ДатаНачалаРасчета = СтрСостояние.ДатаНачалаРасчетаПроцентов;
		НоваяСтр.ПроцентнаяСтавка = ЗалоговыйБилет.ПроцентнаяСхема;
		НоваяСтр.СуммаПроцентовДень = СтрСостояние.СуммаПроцентовДень;
		Если ЗначениеЗаполнено(ДокументИзъятия) тогда   
			ДокументОбъект = ДокументИзъятия.ПолучитьОбъект();
		Иначе	
			ДокументОбъект = СоздатьНовоеИзъятие();			
		КонецЕсли; 
		СуммаПроцентовДолг = ЛБ_ОбщийМодуль.ПолучитьОстатокПроцентов(ДокументОбъект, ДокументОбъект.ПредыдущаяОперация);
		НоваяСтр.СуммаПроцентовДолг = СуммаПроцентовДолг; 
		
		НоваяСтр = ТаблицаСостояний.Добавить();
		НоваяСтр.Состояние = "Состояние залогового билета после изъятия";
		НоваяСтр.КлючСтроки = 3; 
		НоваяСтр.Статус = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят; 
		НоваяСтр.СуммаЗайма = СтрСостояние.СуммаЗайма;;
		НоваяСтр.ДатаВозврата = СтрСостояние.ДатаВыкупа;
		НоваяСтр.ДатаВозвратаЛьготная = СтрСостояние.ДатаВыкупаЛьготныйСрок; 
		НоваяСтр.ДатаНачалаРасчета = СтрСостояние.ДатаНачалаРасчетаПроцентов;
		//НоваяСтр.ПроцентнаяСтавка = ЗалоговыйБилет.ПроцентнаяСхема;
		//НоваяСтр.СуммаПроцентовДень = СтрСостояние.СуммаПроцентовДень;  
		Если НачалоДня(ДатаДок) < СтрСостояние.ДатаВыкупаЛьготныйСрок тогда 
			ДатаОкончанияРасчетаПроцентов = ДатаДок; //НачалоДня(ДатаДок); 
		Иначе 
			ДатаОкончанияРасчетаПроцентов = НачалоДня(СтрСостояние.ДатаВыкупаЛьготныйСрок); 
		КонецЕсли;
		Если НЕ (СтрСостояние.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен ИЛИ СтрСостояние.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят) Тогда
		    Результат = РасчитатьДолгПоПроцентам(СтрСостояние.СуммаЗайма, ЗалоговыйБилет.ПроцентнаяСхема, СтрСостояние.ДатаНачалаРасчетаПроцентов, ДатаОкончанияРасчетаПроцентов); 
			НоваяСтр.СуммаПроцентовДолг = Результат.СуммаПроцентов; 
			НоваяСтр.СуммаЗайма = НоваяСтр.СуммаЗайма - Результат.СуммаОплатыЗайма; 
		Иначе
			НоваяСтр.СуммаПроцентовДолг = СуммаПроцентовДолг;
        КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТовары() 
	Запрос = новый Запрос;   
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Если ЗначениеЗаполнено(ДокументИзъятия) И ДокументИзъятия.Проведен Тогда 
		ДатаПроверки = ДатаДок-1; 
	Иначе	
	    ДатаПроверки = ДатаДок;
	КонецЕсли;	   
	Запрос.УстановитьПараметр("Дата", ДатаПроверки);
	//+Мельников 25.04.24 Отмена операции. Заменил старый запрос т.к. он не учитывал суммы по отмененным операциям.
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ОбъектЗалога КАК ОбъектЗалога,
	               |	СУММА(ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.СуммаРасход) КАК СуммаОплаты
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Обороты(, &Дата, , ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ОбъектЗалога";
	//Запрос.Текст = "ВЫБРАТЬ
	//				|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ОбъектЗалога КАК ОбъектЗалога,
	//				|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.СуммаОборот КАК СуммаОборот,
	//				|	СУММА(ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.СуммаРасход) КАК СуммаОплаты
	//				|ИЗ
	//				|	РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Обороты(, &Дата, , ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты
	//				|ГДЕ
	//				|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ЗалоговыйБилет = &ЗалоговыйБилет
	//				|
	//				|СГРУППИРОВАТЬ ПО
	//				|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ОбъектЗалога,
	//				|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.СуммаОборот,
	//				|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.СуммаРасход";
	//-Мельников
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард КАК Ломбард,
	               |	ЛБ_ОбъектыЗалогаОстатки.Склад КАК Склад,
	               |	СУММА(ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток) КАК Количество
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_ОбъектыЗалогаОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард,
	               |	ЛБ_ОбъектыЗалогаОстатки.Склад";
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	
	ТаблицаТоваров.Очистить();
	Ном = 0;
	Для каждого стр Из ЗалоговыйБилет.Товары цикл 
		Если ЗалоговыйБилет.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда 
			Если НЕ Стр.Переоформить тогда
				Продолжить;
			КонецЕсли;	
		КонецЕсли;	      
		Ном = Ном + 1;
		НоваяСтр = ТаблицаТоваров.Добавить(); 
		НоваяСтр.Номерстроки = Стр.Номерстроки; 
		НоваяСтр.Артикул = ЛБ_УправлениеЛомбардом.АртикулОбъектаЗалога(ЗалоговыйБилет, Ном);
		НоваяСтр.ОбъектЗалога = стр.ОбъектЗалога; 
		Статус = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектаЗалога(ДатаПроверки, НоваяСтр.ОбъектЗалога, ЗалоговыйБилет);
		Если НЕ Статус = неопределено тогда
		    НоваяСтр.СтатусОбъектаЗалога = Статус;
	    КонецЕсли;         
	    НоваяСтр.СуммаОценки = стр.СуммаОценкиМаксимальная;
		НоваяСтр.СуммаОценкиЗайм = стр.СуммаСсуды;  
		Отбор = Новый структура;
		Отбор.Вставить("ОбъектЗалога", НоваяСтр.ОбъектЗалога);
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		Если НЕ строки.Количество() = 0 тогда			
			//+Мельников 25.04.24 Отмена операции. Изменил.
			НоваяСтр.СуммаОплаты = Строки.Получить(0).СуммаОплаты;
			//НоваяСтр.СуммаОплаты = НоваяСтр.СуммаОценки - Строки.Получить(0).СуммаОборот;
			//-Мельников
		КонецЕсли;	 
		НоваяСтр.Задолженность = НоваяСтр.СуммаОценкиЗайм - НоваяСтр.СуммаОплаты;   
		Если Статус = Перечисления.ЛБ_СтатусыОбъектовЗалога.Изъят Тогда
			НоваяСтр.ПроверкаИзъятие = ложь;
			Продолжить;
		КонецЕсли;	        
		
		Отбор.Вставить("Ломбард", Ломбард);
		Строки = ТаблицаОстатков.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 тогда 
			НоваяСтр.ПроверкаИзъятие = Истина; 
			Если ЗначениеЗаполнено(ДокументИзъятия) тогда   
				ОтборДок = Новый структура;
		        ОтборДок.Вставить("ОбъектЗалога", НоваяСтр.ОбъектЗалога);
				СтрокиДок = ДокументИзъятия.ТоварыИзъятыеВозвращенные.НайтиСтроки(ОтборДок);
				Если НЕ СтрокиДок.Количество() = 0 тогда    
					НоваяСтр.Изъять = Истина;
					НоваяСтр.СтатусОбъектаЗалогаПослеИзъятия = Перечисления.ЛБ_СтатусыОбъектовЗалога.Изъят;
				Иначе
					НоваяСтр.СтатусОбъектаЗалогаПослеИзъятия = НоваяСтр.СтатусОбъектаЗалога;
				КонецЕсли;	
			Иначе	
				НоваяСтр.Изъять = Истина; 
				НоваяСтр.СтатусОбъектаЗалогаПослеИзъятия = Перечисления.ЛБ_СтатусыОбъектовЗалога.Изъят;  
			КонецЕсли;	
		Иначе          
			//НоваяСтр.ПроверкаИзъятие = Истина;
			//НоваяСтр.СтатусОбъектаЗалогаПослеИзъятия = НоваяСтр.СтатусОбъектаЗалога;
			//Отбор.Удалить("Ломбард");
			//Строки = ТаблицаОстатков.НайтиСтроки(Отбор);
			//Если НЕ Строки.Количество() = 0 тогда 
			//	Сообщить("Объект залога " + сокрЛП(стр.ОбъектЗалога) + " находится в " + СокрЛП(Строки.Получить(0).Ломбард));
			//Иначе
			//	Сообщить("Местонахождение объекта залога " + сокрЛП(стр.ОбъектЗалога) + " не определено", СтатусСообщения.Важное);
			//КонецЕсли;    
			НоваяСтр.ПроверкаИзъятие = ложь;  
			НоваяСтр.СтатусОбъектаЗалогаПослеИзъятия = НоваяСтр.СтатусОбъектаЗалога;
		КонецЕсли;
		
		Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога);
		Строки = ТаблицаОстатков.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 тогда   
			СтрОст = Строки.Получить(0);
			НоваяСтр.Склад = СтрОст.Склад; 
		Иначе
			Отбор.Удалить("Ломбард");
			Строки = ТаблицаОстатков.НайтиСтроки(Отбор);
			Если НЕ Строки.Количество() = 0 тогда   
				СтрОст = Строки.Получить(0);
				НоваяСтр.Склад = СтрОст.Склад; 
            КонецЕсли;
		КонецЕсли;	

	Конеццикла;	
	
	ТоварыИтогОценка = ТаблицаТоваров.Итог("СуммаОценки");
	ТоварыИтогОценкаЗайм = ТаблицаТоваров.Итог("СуммаОценкиЗайм");
	ТоварыИтогОплата = ТаблицаТоваров.Итог("СуммаОплаты");
	ТоварыИтогДолг = ТаблицаТоваров.Итог("Задолженность");
КонецПроцедуры	

&НаКлиенте
Процедура ИсторияЗБ(Команда)
	Если ЗначениеЗаполнено(ЗалоговыйБилет) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", ПолучитьЗалогодателя());
		ПараметрыФормы.Вставить("ЗалоговыйБилет", ЗалоговыйБилет);	 
								
		ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция СнятьСПроведения(Документ)  
	ДокОбъект = Документ.ПолучитьОбъект(); 
	Если ДокОбъект.Проведен Тогда  
		ЗапросП = Новый Запрос;  
		ЗапросП.УстановитьПараметр("ЗБ", ЗалоговыйБилет); 
		ЗапросП.УстановитьПараметр("Ссылка", Документ);  
		ЗапросП.УстановитьПараметр("Дата", ДатаДок);
		ЗапросП.Текст = "ВЫБРАТЬ
		                |	ЛБ_ОперацияПоЗалогу.Ссылка КАК Ссылка
		                |ИЗ
		                |	Документ.ЛБ_ОперацияПоЗалогу КАК ЛБ_ОперацияПоЗалогу
		                |ГДЕ
		                |	ЛБ_ОперацияПоЗалогу.ПредыдущаяОперация = &ЗБ
		                |	И ЛБ_ОперацияПоЗалогу.Проведен = ИСТИНА
		                |	И ЛБ_ОперацияПоЗалогу.Дата >= &Дата
		                |	И НЕ ЛБ_ОперацияПоЗалогу.Ссылка = &Ссылка";
		ВыборкаП = ЗапросП.Выполнить().Выбрать();
		Если ВыборкаП.Следующий() тогда 
			Сообщить("По залоговому билету " + СокрЛП(Документ.НомерЗалоговогоБилета) + " есть проведенные документы с более поздней датой. Редактирование запрещено.");
			Возврат Ложь;
		КонецЕсли;                                          
		Попытка
		    ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);  
			Возврат Истина;
		Исключение   
			Сообщить("Не удалось снять с проведения документ изъятия объектов залога. Редактирование запрещено.");
			Возврат Ложь;
		КонецПопытки;	
	Иначе
		возврат Истина;
	КонецЕсли;
КонецФункции	


&НаКлиенте
Процедура Редактировать(Команда)
	ПроверкаМожноРедактировать = Истина;
	Если ЭтаФорма.НеРедактировать Тогда 
		Результат = СнятьСПроведения(ДокументИзъятия);
		Если НЕ Результат тогда  
			ПроверкаМожноРедактировать = Ложь;
		КонецЕсли;	
		Если ПроверкаМожноРедактировать Тогда  
			НеРедактировать = Ложь;
			Элементы.ОсновнаяПанель.ТолькоПросмотр = Ложь;
			Этаформа.Открыть();
		КонецЕсли;	
	КонецЕсли;	
	//+Мельников 25.04.24 Отмена операции.
	УстановитьВидимость();
	//-Мельников
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	Для каждого стр из ТаблицаТоваров цикл
		Если стр.СтатусОбъектаЗалога = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыОбъектовЗалога.Изъят") Тогда
			Продолжить;
		КонецЕсли;	
		Стр.Изъять = Истина; 		 
		стр.СтатусОбъектаЗалогаПослеИзъятия = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыОбъектовЗалога.Изъят");
	Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметку(Команда)
	Для каждого стр из ТаблицаТоваров цикл
		Если стр.СтатусОбъектаЗалога = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыОбъектовЗалога.Изъят") Тогда
			Продолжить;
		КонецЕсли;	
		Стр.Изъять = Ложь;  
		Стр.СтатусОбъектаЗалогаПослеИзъятия = Стр.СтатусОбъектаЗалога;
	Конеццикла;	
КонецПроцедуры    

&НаСервере
Функция СоздатьДокументНаСервере()  
	Если ЗначениеЗаполнено(ДокументИзъятия) Тогда
		ДокументОбъект = ДокументИзъятия.ПолучитьОбъект();
		ДокументОбъект.Дата = ДатаДок;
	Иначе	         		
	    ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
		ДокументОбъект.Дата = ДатаДок;
		ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ИзъятиеОбъектовЗалога;  
	    ДокументОбъект.ПредыдущаяОперация = ЗалоговыйБилет;
        ДокументОбъект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить(); 
      	ДокументОбъект.СтатусЗалогодателя = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(ДокументОбъект.Дата, ДокументОбъект.ПредыдущаяОперация.Залогодатель); 
		ДокументОбъект.Залогодатель = ЗалоговыйБилет.Залогодатель;  
		ДокументОбъект.ДокументЗалогодателя = ЗалоговыйБилет.ДокументЗалогодателя;
		ДокументОбъект.СхемаКредитования = ЗалоговыйБилет.СхемаКредитования;  
		ДокументОбъект.СрокЗалога = ЗалоговыйБилет.СрокЗалога; 
		ДокументОбъект.Акция = ЗалоговыйБилет.Акция;
		ДокументОбъект.НомерЗалоговогоБилета = ЗалоговыйБилет.НомерЗалоговогоБилета;  
		ДокументОбъект.Товары.Загрузить(ДокументОбъект.ПредыдущаяОперация.Товары.Выгрузить());
		ДокументОбъект.Вставки.Загрузить(ДокументОбъект.ПредыдущаяОперация.Вставки.Выгрузить());
		ДокументОбъект.ДополнительныеМеталлы.Загрузить(ДокументОбъект.ПредыдущаяОперация.ДополнительныеМеталлы.Выгрузить());
		ДокументОбъект.Дефекты.Загрузить(ДокументОбъект.ПредыдущаяОперация.Дефекты.Выгрузить());   
		Если ДокументОбъект.ПредыдущаяОперация.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда
			СтрокиТоварыУдалить = Новый СписокЗначений;
			СтрокиДефектыУдалить = Новый СписокЗначений;
			СтрокиВставкиУдалить = Новый СписокЗначений;
			СтрокиДополнительныеМеталлыУдалить = Новый СписокЗначений;
			Для каждого СтрТ Из ДокументОбъект.Товары Цикл  
				Если НЕ СтрТ.Переоформить Тогда
					СтрокиТоварыУдалить.Добавить(СтрТ);
					ОтборТ = Новый Структура;
					ОтборТ.Вставить("КлючСтроки", СтрТ.КлючСтроки); 
					
					СтрокиД = ДокументОбъект.Дефекты.НайтиСтроки(ОтборТ);
					Для каждого СтрД Из СтрокиД Цикл 
						СтрокиДефектыУдалить.Добавить(СтрД);
					КонецЦикла;	 
					
					СтрокиВ = ДокументОбъект.Вставки.НайтиСтроки(ОтборТ);
					Для каждого СтрВ Из СтрокиВ Цикл 
						СтрокиВставкиУдалить.Добавить(СтрВ);
					КонецЦикла;	
					
					СтрокиДМ = ДокументОбъект.ДополнительныеМеталлы.НайтиСтроки(ОтборТ);
					Для каждого СтрДМ Из СтрокиДМ Цикл 
						СтрокиДополнительныеМеталлыУдалить.Добавить(СтрДМ);
					КонецЦикла;	
				КонецЕсли;	
			КонецЦикла;	        
			Для каждого Эл Из СтрокиТоварыУдалить Цикл 
				ДокументОбъект.Товары.Удалить(Эл.Значение);
			КонецЦикла;	
			Для каждого Эл Из СтрокиДефектыУдалить Цикл 
				ДокументОбъект.Дефекты.Удалить(Эл.Значение);
			КонецЦикла;	 
            Для каждого Эл Из СтрокиВставкиУдалить Цикл 
				ДокументОбъект.Вставки.Удалить(Эл.Значение);
			КонецЦикла;	 
            Для каждого Эл Из СтрокиДополнительныеМеталлыУдалить Цикл 
				ДокументОбъект.ДополнительныеМеталлы.Удалить(Эл.Значение);
			КонецЦикла;	 			 
		КонецЕсли;	
	КонецЕсли;	
	ДокументОбъект.Ломбард = Ломбард; 
	//ДокументОбъект.Ответственный = ОтветственныйПользователь; 
	ДокументОбъект.ОтветственныйПользователь = ОтветственныйПользователь;
	ДокументОбъект.ОтветственныйСотрудник = ОтветственныйСотрудник;

	ДокументОбъект.Комментарий = Комментарий;
	ДокументОбъект.ДатаИзъятия = ДатаИзъятия;  
	ДокументОбъект.ГосОрганИзъятие = ГосОрганИзъятие;
	ДокументОбъект.ДатаПротоколИзъятия = ДатаПротоколИзъятия;
	ДокументОбъект.ДокументИзъятияНаименование = ДокументИзъятияНаименование;
	ДокументОбъект.ДокументИзъятияДатаВыдачи = ДокументИзъятияДатаВыдачи;
	ДокументОбъект.ДокументИзъятияКемВыдан = ДокументИзъятияКемВыдан;
	ДокументОбъект.ФИОДолжностьИзъятие = ФИОДолжностьИзъятие;
	ДокументОбъект.ФИОДолжностьСудьи = ФИОДолжностьСудьи;


	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("Залогодатель", ДокументОбъект.Залогодатель);
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество
                   |ИЗ
                   |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбъект.Фамилия = Выборка.Фамилия;
        ДокументОбъект.Имя = Выборка.Имя;
        ДокументОбъект.Отчество = Выборка.Отчество;		
		ДокументОбъект.ДатаРождения = Выборка.ДатаРождения;		
		ДокументОбъект.Гражданство = Выборка.Гражданство;
		ДокументОбъект.Пол = Выборка.Пол;  
		ДокументОбъект.ВозрастЗалогодателя = ЛБ_ОбщийМодуль.ВычислитьВозраст(ДокументОбъект.ДатаРождения);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокументЗалогодателя", ДокументОбъект.ДокументЗалогодателя);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя = &ДокументЗалогодателя) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбъект.ДокументВидДокументаЗалогодателя = Выборка.ВидДокументаЗалогодателя;
		ДокументОбъект.ДокументВид = Выборка.ВидДокумента;
		ДокументОбъект.ДокументГражданство = Выборка.Гражданство;
		ДокументОбъект.ДокументСерия = Выборка.ДокументСерия;
		ДокументОбъект.ДокументНомер = Выборка.ДокументНомер;
		ДокументОбъект.ДокументДатаВыдачи = Выборка.ДокументДатаВыдачи;
		ДокументОбъект.ДокументКемВыдан = Выборка.ДокументКемВыдан;
		ДокументОбъект.ДокументКодПодразделения = Выборка.ДокументКодПодразделения;
		ДокументОбъект.ДокументНачалоДействия = Выборка.ДокументНачалоДействия;
		ДокументОбъект.ДокументСрокДействия = Выборка.ДокументСрокДействия;
	КонецЕсли;     
	
	
	Для каждого стр из ДокументОбъект.Товары Цикл 
		Стр.СуммаОплаты = 0;
		
		Отбор = новый структура;
		Отбор.Вставить("ОбъектЗалога", стр.ОбъектЗалога);
		
		СтрокиТ = ТаблицаТоваров.НайтиСтроки(Отбор); 
		Если НЕ СтрокиТ.Количество() = 0 Тогда
			СтрТ = строкиТ.получить(0); 
			Стр.СуммаОплаты = СтрТ.СуммаОплатыПереплата;
		КонецЕсли;	                                                      
	Конеццикла;	  
		
	
	ДокументОбъект.ТоварыИзъятыеВозвращенные.Очистить();
	Для каждого стр из ТаблицаТоваров Цикл 
		Если НЕ стр.Изъять Тогда
			Продолжить;
		КонецЕсли;	
		НоваяСтр = ДокументОбъект.ТоварыИзъятыеВозвращенные.Добавить();
		НоваяСтр.ОбъектЗалога = Стр.ОбъектЗалога;  
		НоваяСтр.СуммаОценки = Стр.СуммаОценки;
	Конеццикла;	
	
	Отбор = Новый структура;
	Отбор.Вставить("КлючСтроки", 2);
	Строки = ТаблицаСостояний.НайтиСтроки(Отбор);  
	СтрНач = Строки.Получить(0);
	ДокументОбъект.ДатаВыкупа = СтрНач.ДатаВозврата;
    ДокументОбъект.ДатаВыкупаЛьготная = СтрНач.ДатаВозвратаЛьготная;	
	ДокументОбъект.СуммаСсуды = СтрНач.СуммаЗайма;  
	
	ДокументОбъект.НачислениеПроцентовДетально.Очистить();
	Для каждого стр из ТаблицаОплатДетально Цикл 
	    НоваяСтр = ДокументОбъект.НачислениеПроцентовДетально.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтр, стр);  
		Если Стр.ДеньНач = 1 Тогда     
			СтавкаП = Стр.ПроцентнаяСтавкаБазовая; 
			Если Стр.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда
				Если НЕ Стр.ПроцентнаяСтавкаАкция = 0 Тогда
					СтавкаП = Стр.ПроцентнаяСтавкаАкция;
				ИначеЕсли НЕ Стр.ОтклонениеАкцияОтносительное = 0 Тогда	 
					СтавкаП = Стр.ПроцентнаяСтавкаБазовая + Стр.ПроцентнаяСтавкаБазовая*Стр.ОтклонениеАкцияОтносительное/100;
				ИначеЕсли НЕ Стр.ОтклонениеАкцияАбсолютное = 0 Тогда
					СтавкаП = Стр.ПроцентнаяСтавкаБазовая + Стр.ОтклонениеАкцияАбсолютное;
			    КонецЕсли; 
			КонецЕсли;	
			ДокументОбъект.ПроцентнаяСхема = ставкаП;
		КонецЕсли;	
	КонецЦиклА;    
		    	 	
		
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	Попытка           
	    ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение); 
		ДокументИзъятия = ДокументОбъект.Ссылка;
		Возврат ложь;
	Исключение   
		ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ " + строка(ДокументОбъект.Ссылка));
		Возврат Истина;
	КонецПопытки;  
КонецФункции	
	
&НаСервере
Функция ПроверкаДокумента()
	ВсеОК = ПроверитьЗаполнение(); 
	
	Если ДокументИзъятияДатаВыдачи > НачалоДня(ДатаДок) Тогда 
		Сообщить("Дата выдачи документа изъятия не может быть больше даты изъятия изделия в ломбарде!");
		ВсеОК = Ложь;
	КонецЕсли;	
	
	ЕстьИзъятие = ложь;
	Для каждого стр из ТаблицаТоваров Цикл 
		Если стр.Изъять Тогда
			ЕстьИзъятие = Истина;
			Прервать;
		КонецЕсли;	
	Конеццикла;	
	Если НЕ ЕстьИзъятие тогда
		Сообщить("Не выбраны изымаемые объекты залога!");
		ВсеОК = Ложь;
	КонецЕсли;	
	Возврат ВсеОК;
КонецФункции	

&НаСервере
Функция ПроверитьЕстьВНакладной()
	Возврат  ЛБ_УправлениеЛомбардом.ПолучитьСтатусНакладнойПоЗБ(ДатаДок, ЗалоговыйБилет); 
КонецФункции 

&НаСервере
Функция ПолучитьНомерЗБ() 
	Возврат ЗалоговыйБилет.НомерЗалоговогоБилета;
КонецФункции

&НаСервере
Функция ПолучитьРеквизитыНакладной(НакладнаяНаОтгрузку)  
	СтруктураВ = Новый Структура;
	СтруктураВ.Вставить("Номер", НакладнаяНаОтгрузку.ПредставлениеНомераНакладной); 
	СтруктураВ.Вставить("Дата", НакладнаяНаОтгрузку.Дата);
	Возврат СтруктураВ; 
КонецФункции

&НаКлиенте
Процедура Изъять(Команда)
	Если НеРедактировать тогда
		Возврат;
	КонецЕсли;
	
	Если ПроверкаДокумента() Тогда
		//+МАН 02.12.24 Закомментировал и перенес ниже т.к. Вначале проводился документ, а уже после шли все проверки. Заявка 2904
		//ЕстьНеПроведенные  = СоздатьДокументНаСервере(); 
		//-МАН
		
		СтруктураВ = ПроверитьЕстьВНакладной();
		Если СтруктураВ = неопределено Тогда
			ЕстьВНакладной = Ложь;
		Иначе
			ЕстьВНакладной = Истина;
			НакладнаяНаОтгрузку = СтруктураВ.НакладнаяНаОтгрузку; 
			СтатусНакладной = СтруктураВ.СтатусНакладной;
		КонецЕсли;  
		
		Если ЕстьВНакладной Тогда   
			СтруктураН = ПолучитьРеквизитыНакладной(НакладнаяНаОтгрузку); 
		    ТекстПредупреждения = "Предметы залога ЗБ № " + СокрЛП(ПолучитьНомерЗБ()) + " в накладной № " + СокрЛП(СтруктураН.Номер)+ " от " + Формат(СтруктураН.Дата, "ДЛФ=DT");
			Если СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.Отгружена") Тогда 
				ТекстПредупреждения = ТекстПредупреждения + " уже отгружены.";
			    ТекстПредупреждения = ТекстПредупреждения + " Проведение операции невозможно!";   			
				Предупреждение(ТекстПредупреждения, 60);
				Возврат;
		    ИначеЕсли СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаОткрыта") ИЛИ  
				      СтатусНакладной = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыНакладнойНаОтгрузку.СумкаЗакрыта") Тогда  
			   ТекстПредупреждения = ТекстПредупреждения + " в сумке.";		  
			   ТекстПредупреждения = ТекстПредупреждения + Символы.ПС + "Для изъятия объектов залога измените статус накладной и вскройте сумку."; 
			   
		   	   Предупреждение(ТекстПредупреждения, 60);  
			   Возврат;
		   Иначе                   
			   //+МАН 16.12.24 Изменил сообщение. Заявка 2904.
			   //ТекстПредупреждения = ТекстПредупреждения + Символы.ПС + "Внимание! В результате изъятия все предметы залога будут исключены из накладной!";
			   ТекстПредупреждения = "Внимание! В результате изъятия предметы залога по ЗБ № " + СокрЛП(ПолучитьНомерЗБ())
			   + " будут исключены из накладной № " + СокрЛП(СтруктураН.Номер)+ " от " + Формат(СтруктураН.Дата, "ДЛФ=DT");
			   //-МАН
			   Предупреждение(ТекстПредупреждения, 60);
		    КонецЕсли;	   
		КонецЕсли;		  

		//+МАН 02.12.24 Заявка 2904
		ЕстьНеПроведенные  = СоздатьДокументНаСервере();
		//-МАН
		
		Если НЕ ЕстьНеПроведенные Тогда
			НеРедактировать = Истина;
			Элементы.ДекорацияСтатусДокумента.Заголовок = "Факт"; 
			Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноБордовый;  
			Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.ТусклоРозовый;
	        Элементы.Редактировать.Видимость = Истина; 
			Элементы.Изъять.Доступность = Ложь;
		    Элементы.Отмена.Заголовок = "Закрыть"; 
			Элементы.ОсновнаяПанель.ТолькоПросмотр = НеРедактировать; 
			Если ВладелецФормы.ИмяФормы = "ОбщаяФорма.ЛБ_РабочееМестоПриемщикаЛомбарда" Тогда
	   	        ФормаРМП = ВладелецФормы;   
				Если ФормаРМП.Залогодатель = ПолучитьЗалогодателя() Тогда
	                ФормаРМП.ПослеВыбораТекущееСостояниеЗБ(Истина, неопределено); 
				КонецЕсли;	
            КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
	//+Мельников 25.04.24 Отмена операции.
	УстановитьВидимость();
	//-Мельников
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть(?(ЗначениеЗаполнено(ДокументИзъятия), ДокументИзъятия, неопределено));
КонецПроцедуры


&НаКлиенте
Процедура ДатаДокПриИзменении(Элемент)
	ДатаИзъятия = ДатаДок;
	ДатаПротоколИзъятия = ДатаДок; 
	ЗаполнитьТовары();
	ЗаполнитьСостояниеЗалоговогоБилета();
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаТоваровИзъятьПриИзменении(Элемент)
	ТекСтрока = Элементы.ТаблицаТоваров.ТекущиеДанные;
	Если ТекСтрока.Изъять тогда  
		ТекСтрока.СтатусОбъектаЗалогаПослеИзъятия = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыОбъектовЗалога.Изъят");
	Иначе    
		ТекСтрока.СтатусОбъектаЗалогаПослеИзъятия = ТекСтрока.СтатусОбъектаЗалога;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Вперед(Команда)
	Если Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаОсновная тогда 
		Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаДополнительно; 
	КонецЕсли;	  
	ПриСменеСтраницы(Элементы.ОсновнаяПанель.ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	Если Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаДополнительно тогда 
		Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаОсновная; 
	конецЕсли;	  
	ПриСменеСтраницы(Элементы.ОсновнаяПанель.ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеСтраницы(ТекущаяСтраница)
    Если ТекущаяСтраница = Элементы.СтраницаОсновная Тогда 
		Элементы.Вперед.Доступность = Истина; 
		Элементы.Назад.Доступность = Ложь;
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаДополнительно Тогда 
		Элементы.Вперед.Доступность = Ложь; 
		Элементы.Назад.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ОсновнаяПанельПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ПриСменеСтраницы(ТекущаяСтраница);
КонецПроцедуры

&НаСервере
Функция ПолучитьЗалогодателя()
	Возврат  ЗалоговыйБилет.Залогодатель;
КонецФункции

&НаКлиенте
Процедура СтатистикаПоКлиенту(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Клиент", ПолучитьЗалогодателя());
	ПараметрыФормы.Вставить("Дата", ДатаДок);	 
							
	ОткрытьФорму("Отчет.ЛБ_СтатистикаОбращенийКлиента.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура Расчеты(Команда)
	ПараметрыФормы = Новый Структура;  
	ПараметрыФормы.Вставить("Клиент", ПолучитьЗалогодателя());
	ПараметрыФормы.Вставить("ЗалоговыйБилет", ЭтаФорма.ЗалоговыйБилет);	
	ПараметрыФормы.Вставить("Дата", ЭтаФорма.ДатаДок);
							
	ОткрытьФорму("Отчет.ЛБ_НачисленныеПроцентыПоДоговоруЗайма.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЛомбардПриИзменении(Элемент)
	ЗаполнитьТовары(); 
	ЗаполнитьСостояниеЗалоговогоБилета();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

//+Мельников 25.04.24 Отмена операции
&НаКлиенте
Процедура ОтменитьОперацию(Команда)

	ПоследняяОперация = ПолучитьИнформациюОЗБ(ЗалоговыйБилет, ТекущаяДата());
	ЛомбардПользователя = ПолучитьЛомбардПольвателя();
	ЛомбардВДокументе = ПолучитьЛомбардВдокументе(ПоследняяОперация.ДокументОперации);
	
	Если ЛомбардВДокументе = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис") И СотрудникЦО Тогда 
		Если Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy") <> Формат(ПоследняяОперация.Дата, "ДФ=dd.MM.yyyy") Тогда
			Предупреждение("Отмена операции возможна только в текущем дне.");
			Возврат;
        КонецЕсли;
	Иначе	
		Если ЛомбардПользователя <> ЛомбардВДокументе Тогда
			Предупреждение("Операция оформлена в другом ломбарде.
			|Действия с документом запрещены!");
			Возврат
		ИначеЕсли Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy") <> Формат(ПоследняяОперация.Дата, "ДФ=dd.MM.yyyy") Тогда
			Предупреждение("Отмена операции возможна только в текущем дне.");
			Возврат
		ИначеЕсли ТекущаяДата() - ДатаДок >= 3600 Тогда
			Предупреждение("Прошло больше часа от времени оформления текущей операции.");
			Возврат  
		КонецЕсли;	
	КонецЕсли;
		
	Ответ = Вопрос("Выполнить отмену текущей операции?", РежимДиалогаВопрос.ДаНет);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ДокументПроведен = ОтменитьОперациюНаСервере();
		УстановитьВидимость();
		ОбновитьИнтерфейс();
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ДокументПроведен Тогда
		Сообщить("Документ отмены создан");   
		Если ВладелецФормы.ИмяФормы = "ОбщаяФорма.ЛБ_РабочееМестоПриемщикаЛомбарда" Тогда
   	        ФормаРМП = ВладелецФормы;   
			Если ФормаРМП.Залогодатель = ПолучитьЗалогодателя() Тогда
                ФормаРМП.ПослеВыбораТекущееСостояниеЗБ(Истина, неопределено); 
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция ОтменитьОперациюНаСервере()
	
	ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
	ДокументОбъект.Дата = ТекущаяДата();
	ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаИзъятия;  
	ДокументОбъект.ПредыдущаяОперация = ЗалоговыйБилет;
	ДокументОбъект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить(); 
	ДокументОбъект.СтатусЗалогодателя = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(ДокументОбъект.Дата, ДокументОбъект.ПредыдущаяОперация.Залогодатель); 
	ДокументОбъект.Залогодатель = ЗалоговыйБилет.Залогодатель;  
	ДокументОбъект.ДокументЗалогодателя = ЗалоговыйБилет.ДокументЗалогодателя;
	ДокументОбъект.СхемаКредитования = ЗалоговыйБилет.СхемаКредитования;  
	ДокументОбъект.СрокЗалога = ЗалоговыйБилет.СрокЗалога; 
	ДокументОбъект.Акция = ЗалоговыйБилет.Акция;
	ДокументОбъект.НомерЗалоговогоБилета = ЗалоговыйБилет.НомерЗалоговогоБилета;  
	ДокументОбъект.Товары.Загрузить(ДокументОбъект.ПредыдущаяОперация.Товары.Выгрузить());
	ДокументОбъект.Вставки.Загрузить(ДокументОбъект.ПредыдущаяОперация.Вставки.Выгрузить());
	ДокументОбъект.ДополнительныеМеталлы.Загрузить(ДокументОбъект.ПредыдущаяОперация.ДополнительныеМеталлы.Выгрузить());
	ДокументОбъект.Дефекты.Загрузить(ДокументОбъект.ПредыдущаяОперация.Дефекты.Выгрузить()); 
	ДокументОбъект.Ломбард = Ломбард; 
	ДокументОбъект.ОтветственныйПользователь = ОтветственныйПользователь;   
	ДокументОбъект.ОтветственныйСотрудник = ОтветственныйСотрудник;

	ДокументОбъект.Комментарий = Комментарий;
	ДокументОбъект.ДатаИзъятия = ДатаИзъятия;  
	ДокументОбъект.ГосОрганИзъятие = ГосОрганИзъятие;
	ДокументОбъект.ДатаПротоколИзъятия = ДатаПротоколИзъятия;
	ДокументОбъект.ДокументИзъятияНаименование = ДокументИзъятияНаименование;
	ДокументОбъект.ДокументИзъятияДатаВыдачи = ДокументИзъятияДатаВыдачи;
	ДокументОбъект.ДокументИзъятияКемВыдан = ДокументИзъятияКемВыдан;
	ДокументОбъект.ФИОДолжностьИзъятие = ФИОДолжностьИзъятие;
	ДокументОбъект.ФИОДолжностьСудьи = ФИОДолжностьСудьи;
	ДокументОбъект.ОтмененныйДокумент = ДокументИзъятия;

	Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество
                   |ИЗ
                   |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";

	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("Залогодатель", ДокументОбъект.Залогодатель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбъект.Фамилия = Выборка.Фамилия;
        ДокументОбъект.Имя = Выборка.Имя;
        ДокументОбъект.Отчество = Выборка.Отчество;		
		ДокументОбъект.ДатаРождения = Выборка.ДатаРождения;		
		ДокументОбъект.Гражданство = Выборка.Гражданство;
		ДокументОбъект.Пол = Выборка.Пол;  
		ДокументОбъект.ВозрастЗалогодателя = ЛБ_ОбщийМодуль.ВычислитьВозраст(ДокументОбъект.ДатаРождения);
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя = &ДокументЗалогодателя) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";

	Запрос.УстановитьПараметр("ДокументЗалогодателя", ДокументОбъект.ДокументЗалогодателя);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбъект.ДокументВидДокументаЗалогодателя = Выборка.ВидДокументаЗалогодателя;
		ДокументОбъект.ДокументВид = Выборка.ВидДокумента;
		ДокументОбъект.ДокументГражданство = Выборка.Гражданство;
		ДокументОбъект.ДокументСерия = Выборка.ДокументСерия;
		ДокументОбъект.ДокументНомер = Выборка.ДокументНомер;
		ДокументОбъект.ДокументДатаВыдачи = Выборка.ДокументДатаВыдачи;
		ДокументОбъект.ДокументКемВыдан = Выборка.ДокументКемВыдан;
		ДокументОбъект.ДокументКодПодразделения = Выборка.ДокументКодПодразделения;
		ДокументОбъект.ДокументНачалоДействия = Выборка.ДокументНачалоДействия;
		ДокументОбъект.ДокументСрокДействия = Выборка.ДокументСрокДействия;
	КонецЕсли;     
	
	
	Для каждого стр из ДокументОбъект.Товары Цикл 
		Стр.СуммаОплаты = 0;
		
		Отбор = новый структура;
		Отбор.Вставить("ОбъектЗалога", стр.ОбъектЗалога);
		
		СтрокиТ = ТаблицаТоваров.НайтиСтроки(Отбор); 
		Если НЕ СтрокиТ.Количество() = 0 Тогда
			СтрТ = строкиТ.получить(0); 
			Стр.СуммаОплаты = СтрТ.СуммаОплатыПереплата;
		КонецЕсли;	                                                      
	Конеццикла;
	
	ДокументОбъект.ТоварыИзъятыеВозвращенные.Очистить();
	Для каждого стр из ТаблицаТоваров Цикл 
		Если НЕ стр.Изъять Тогда
			Продолжить;
		КонецЕсли;	
		НоваяСтр = ДокументОбъект.ТоварыИзъятыеВозвращенные.Добавить();
		НоваяСтр.ОбъектЗалога = Стр.ОбъектЗалога;  
		НоваяСтр.СуммаОценки = Стр.СуммаОценки;
	Конеццикла;	
	
	Отбор = Новый структура;
	Отбор.Вставить("КлючСтроки", 2);
	Строки = ТаблицаСостояний.НайтиСтроки(Отбор);  
	СтрНач = Строки.Получить(0);
	ДокументОбъект.ДатаВыкупа = СтрНач.ДатаВозврата;
    ДокументОбъект.ДатаВыкупаЛьготная = СтрНач.ДатаВозвратаЛьготная;	
	ДокументОбъект.СуммаСсуды = СтрНач.СуммаЗайма;  
	
	ДокументОбъект.НачислениеПроцентовДетально.Очистить();
	Для каждого стр из ТаблицаОплатДетально Цикл 
	    НоваяСтр = ДокументОбъект.НачислениеПроцентовДетально.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтр, стр);  
		Если Стр.ДеньНач = 1 Тогда     
			СтавкаП = Стр.ПроцентнаяСтавкаБазовая; 
			Если Стр.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда
				Если НЕ Стр.ПроцентнаяСтавкаАкция = 0 Тогда
					СтавкаП = Стр.ПроцентнаяСтавкаАкция;
				ИначеЕсли НЕ Стр.ОтклонениеАкцияОтносительное = 0 Тогда	 
					СтавкаП = Стр.ПроцентнаяСтавкаБазовая + Стр.ПроцентнаяСтавкаБазовая*Стр.ОтклонениеАкцияОтносительное/100;
				ИначеЕсли НЕ Стр.ОтклонениеАкцияАбсолютное = 0 Тогда
					СтавкаП = Стр.ПроцентнаяСтавкаБазовая + Стр.ОтклонениеАкцияАбсолютное;
			    КонецЕсли; 
			КонецЕсли;	
			ДокументОбъект.ПроцентнаяСхема = ставкаП;
		КонецЕсли;	
	КонецЦиклА;
	
	ДокументОбъект.ТаблицаСостоянийОтмененного.Очистить();
	Для каждого СтрСостояния Из ТаблицаСостояний Цикл
		
		НоваяСтрСостояния = ДокументОбъект.ТаблицаСостоянийОтмененного.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрСостояния, СтрСостояния,, "Статус");
	
		НоваяСтрСостояния.Статус = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ПустаяСсылка();
		
		Для Номер=0 По Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Количество()-1 Цикл
			Если Строка(Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Получить(Номер)) = СтрСостояния.Статус Тогда
				
				НоваяСтрСостояния.Статус = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Получить(Номер);
				Прервать;
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	Попытка           
	    ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение); 

		//+МАН 17.06.25 Убрал
		//ДокументОтмены = ДокументОбъект.Ссылка;

		////Установка отментки об отмене документа в отменяемом документе
		//ОтменяемыйДокумент = ДокументИзъятия.ПолучитьОбъект();
		//ОтменяемыйДокумент.ДокументОтмены = ДокументОтмены;
		//
		//ОтменяемыйДокумент.Записать(РежимЗаписиДокумента.Запись);
		//
		//Попытка           
		//    ОтменяемыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		//Исключение
		//	ОбщегоНазначения.СообщитьПользователю("Не удалось установить отметку в отменяемом документе");
		//КонецПопытки;
		//
		
		Возврат Истина;
	Исключение   
		ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ " + строка(ДокументОбъект.Ссылка));
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИнформациюОЗБ(ЗалоговыйБилет, Дата)

	Результат = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(ЗалоговыйБилет.НомерЗалоговогоБилета, Дата,, Истина);
	
	//+Мельников 06.05.24 Сделано на время тестирования. Убрать при запуске ломбардов.
	Если Результат = Неопределено Тогда
		ДатаПроверки = ТекущаяДата() + 94608000; // + три года к дате проверки документа
		Результат = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(ЗалоговыйБилет.НомерЗалоговогоБилета, ДатаПроверки,, Истина);
	КонецЕсли;
	//-Мельников

	ПоследняяОперация = Новый Структура;
	ПоследняяОперация.Вставить("Дата", Результат.Регистратор.Дата);
	ПоследняяОперация.Вставить("ВидОперации", Результат.Регистратор.ВидОперации);
	ПоследняяОперация.Вставить("ДокументОперации", Результат.Регистратор);
	
	Возврат ПоследняяОперация;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЛомбардПольвателя()
	Возврат ЛБ_ОбщийМодуль.ПолучитьЛомбардПользователя(ПараметрыСеанса.ТекущийПользователь);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЛомбардВдокументе(Ссылка)
	Возврат Ссылка.Ломбард;
КонецФункции

&НаСервере
Процедура УстановитьВидимость()

	ПроверкаПоследующихОпереаций = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(ЗалоговыйБилет.НомерЗалоговогоБилета, ТекущаяДата(),,Истина);
	ЛомбардПользователя = ЛБ_ОбщийМодуль.ПолучитьЛомбардПользователя(ПараметрыСеанса.ТекущийПользователь);
	
	Если ДокументИзъятия.Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда 
		Если ДокументИзъятия.Проведен И НачалоДня(ТекущаяДатаСеанса()) = НачалоДня(ДатаДок) И
			?(ЗначениеЗаполнено(ДокументИзъятия), ?(ПроверкаПоследующихОпереаций = Неопределено, Истина, ?(ПроверкаПоследующихОпереаций.Регистратор = ДокументИзъятия, Истина, Ложь)), Ложь) Тогда
			
			Элементы.ОтменитьОперацию.Доступность = Истина;
		Иначе
			Элементы.ОтменитьОперацию.Доступность = Ложь;
		КонецЕсли; 
	Иначе	
		Если ДокументИзъятия.Проведен И НЕ ТекущаяДата() - ДатаДок >= 3600 И ЛомбардПользователя = ДокументИзъятия.Ломбард И
			?(ЗначениеЗаполнено(ДокументИзъятия), ?(ПроверкаПоследующихОпереаций = Неопределено, Истина, ?(ПроверкаПоследующихОпереаций.Регистратор = ДокументИзъятия, Истина, Ложь)), Ложь) Тогда
			
			Элементы.ОтменитьОперацию.Доступность = Истина;
		Иначе
			Элементы.ОтменитьОперацию.Доступность = Ложь;
		КонецЕсли; 
	КонецЕсли;	

	//+МАН 17.06.25 Изменил
	//Если ЗначениеЗаполнено(ДокументИзъятия.ДокументОтмены) Тогда
	Если ЗначениеЗаполнено(ДокументОтмены) Тогда
	    Элементы.ГруппаОтмена.Видимость = Истина;
		//+Мельников 28.05.24
		Элементы.Расчеты.Доступность = Ложь;
		Элементы.Редактировать.Доступность = Ложь;
		//-Мельников
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОтменыНажатие(Элемент, СтандартнаяОбработка)
	
	Если ПолучитьВидОперации(ДокументОтмены) = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаИзъятия") Тогда 
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Документ", ДокументОтмены);    
		ОткрытьФорму("ОбщаяФорма.ЛБ_ОтменаОперацииПоЗайму", ПараметрыФормы, ЭтаФорма, Истина,,,);	
	Иначе                           
		СтандартнаяОбработка = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидОперации(Ссылка)
    Возврат Ссылка.ВидОперации
КонецФункции

&НаСервере
Функция ПолучитьДокументОтмены(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&Период, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		|ГДЕ
		|	ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент В(&ЗБ)";
	
	Запрос.УстановитьПараметр("ЗБ", Ссылка);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Регистратор;
	КонецЕсли;
	
	Возврат Документы.ЛБ_ОперацияПоЗалогу.ПустаяСсылка();
	
КонецФункции
//-Мельников
